%*******************************模糊聚类********************************
clc,clear
% 编程参考 资料 P19
% 构造模糊相似矩阵
% n个分类对象 m个性态指标

% 导入数据
data = xlsread("测试数据.xlsx");
%data = [1,2,3; 4,5,6; 7,8,9];
X = data;
[n,m] = size(X);
% 求解每一列下的均值
X_means = mean(X,1);
% 求解指标的方差
X_variance = [sum((X - X_means) .^ 2 , 1) ./ (n-1)] .^ 0.5;
%************************数据标准化****************************
% 快捷使用zscore()函数
% 先进行平移——标准差变换
X = X - repmat(X_means , [n,1]);
X = X ./ repmat(X_variance , [n,1]);
disp(X);disp('----------------------------------------------------------')

% 判断变换后的矩阵中是否存在有不在区间[0,1]内的元素
if (sum(sum((X < 0) | (X > 1))) ~= 0)
    disp('平移——标准差变换后的矩阵内存在不在区间[0,1]内的元素');
    Judge = 1;
else
    disp('平移——标准差变换后的矩阵满足要求');
    Judge = 0;
end

if (Judge == 1)
    X_min = repmat(min(X),[n,1]); % 求解每一列下的最小值
    X_max = repmat(max(X),[n,1]); % 求解每一行下的最大值
    X = (X - X_min) ./ (X_max - X_min); 
end
disp('预处理后的矩阵为 : ');disp(X);disp('----------------------------------------------------------')
X = X';
%**********************建立模糊相似矩阵************************
% 使用相关系数法(注意区别平常的相关系数COV) 例外两种方法 指数相似系数法 最大值最小值法
% 构建 n x n 阶模糊相似方阵
%Fuzzy_Matrix = corrcoef(n,n); % 用于存储信息 
%*******使用相关系数法*******
Fuzzy_Matrix = abs(corrcoef(X));

Max = max(max(Fuzzy_Matrix))

Min = min(min(Fuzzy_Matrix))